Revit 2024 API
LightDistribution Members
The LightDistribution type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the LightDistribution derived object.
Dispose
Releases all resources used by the LightDistribution
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace